---
kind: type
id: T:Autodesk.Revit.DB.Lighting.LightShape
source: html/6fc9d0d9-21ac-9192-0178-115be3a48dc7.htm
---
# Autodesk.Revit.DB.Lighting.LightShape

This class is the base class for specifying light shape.

## Syntax (C#)
```csharp
public class LightShape : IDisposable
```